# 公众号配置
# 公众号appId
app_id = "wxfde5c5e829de1111"
# 公众号appSecret
app_secret = "4d99ff8e14bd1b6975706806af93858d"
# 模板消息id
# 每日消息
template_id1 = "ZjFu2crmCoyuNnjBPpV6KNCb0wgme7fQp294-TZ_YJw"
# 课程消息,上课提醒
template_id2 = "	-xF_Pzdn8SbljeEFiJQ-P2rNv3QMPnIE9C-VhUGdatA"
# 晚安心语
template_id3 = "	MPUnrIp9TJx9LlhntRHIi3pMZq-hiuruwQ5Fgt01Ie0"
# 接收公众号消息的微信号
# 这是openid
user = ["o0wbA6dZiXdKRgEvnwqidDuGGtcw"]

# 信息配置
# 所在省份
province = "黑龙江"
# 所在城市
city = "哈尔滨"
# 生日，如果月份或者日期小于10，直接用对应的数字即可，例如1997-1-1，---------倒计时
birthday = "2003-11-26"
# 在一起的日子，格式同上------------计时器
love_date = "2023-7-2"
# 天行数据晚安心语 key
good_Night_Key = "u4kh5o9wl2dnRpW_zZ0pkV-5UV81roGLitCHgX6dUUQ"
# -------------------------------------------------------------------------
# 设置学期第一周开始日期
year = 2023
month = 3
day = 4
# 每日推送时间
post_Time = "07:35:00"
# 每节课提醒时间（有课才会提醒）, 时:分:秒  的形式, 字符串, 根据个人需要设置几次
time_table = ["07:40:00", "10:00:00", "13:05:00", "15:00:00", "16:50:00"]
# 课程时间
course_Time = ["8:10--9:50", "10:10--11:50", "13:15--14:55", "15:05--16:45", "16:55--18:35"]
# 晚安心语及第二天课程推送时间
good_Night_Time = "22:50:00"
# 课程表 "1"代表第一周，依次类推，根据个人实际课表添加，有几周就添加几周,
# 每一行代表一天, 例如  ['', '编译原理', '', '数据库原理及应用', '数据分析原理', '']  代表周一
classes = \
    {
        "1": [
            ['数学思想方法', '小学儿童教育心理学', '小学语文课程标准与教材分析', '小学语文课程标准与教材分析', '小学美术技能'],
            ['', '大学英语', '小学美术技能', '小学数学课程标准与教材分析', '小学数学课程标准与教材分析'],
            ['中外教育名著选读', '毛泽东思想和中国特色社会主义理论体系概论', '', '', ''],
            ['小学教师语言技能', '小学英语课程标准与教材分析', '教学论', '教学论', '', ''],
            ['小学儿童教育心理学', '毛泽东思想和中国特色社会主义理论体系概论', '体育', '小学教师语言技能', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "2":  [
            ['数学思想方法', '小学儿童教育心理学', '小学语文课程标准与教材分析', '小学语文课程标准与教材分析', '小学美术技能'],
            ['', '大学英语', '小学美术技能', '小学数学课程标准与教材分析', '小学数学课程标准与教材分析'],
            ['中外教育名著选读', '毛泽东思想和中国特色社会主义理论体系概论', '', '', ''],
            ['小学教师语言技能', '小学英语课程标准与教材分析', '教学论', '教学论', '', ''],
            ['小学儿童教育心理学', '毛泽东思想和中国特色社会主义理论体系概论', '体育', '小学教师语言技能', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "3":  [
            ['数学思想方法', '小学儿童教育心理学', '小学语文课程标准与教材分析', '小学语文课程标准与教材分析', '小学美术技能'],
            ['', '大学英语', '小学美术技能', '小学数学课程标准与教材分析', '小学数学课程标准与教材分析'],
            ['中外教育名著选读', '毛泽东思想和中国特色社会主义理论体系概论', '', '', ''],
            ['小学教师语言技能', '小学英语课程标准与教材分析', '教学论', '教学论', '', ''],
            ['小学儿童教育心理学', '毛泽东思想和中国特色社会主义理论体系概论', '体育', '小学教师语言技能', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
        "4": [
            ['数学思想方法', '小学儿童教育心理学', '小学语文课程标准与教材分析', '小学语文课程标准与教材分析', '小学美术技能'],
            ['', '大学英语', '小学美术技能', '小学数学课程标准与教材分析', '小学数学课程标准与教材分析'],
            ['中外教育名著选读', '毛泽东思想和中国特色社会主义理论体系概论', '', '', ''],
            ['小学教师语言技能', '小学英语课程标准与教材分析', '教学论', '教学论', '', ''],
            ['小学儿童教育心理学', '毛泽东思想和中国特色社会主义理论体系概论', '体育', '小学教师语言技能', '', ''],
            ['', '', '', '', '', ''],
            ['', '', '', '', '', '']
        ],
    }

